cms/controllers/PageController.php

    public function actionListproducts()
    {

	if(isset($_GET['id'])&& $_GET['id'] !='' && filter_var($_GET['id'], FILTER_VALIDATE_INT))
{
$categories = Categories::find()->where(['id'=>$_GET['id']])->asArray()->one();
if(count($categories) > 0){
$products_array = Products::find()->where(['category'=>$_GET['id']])->asArray()->all();
---
SELECT * FROM `categories` WHERE `id`='1'
SELECT * FROM `products` WHERE `category`='1'

public function actionCatalog()
    {
	$categories = Categories::find()->asArray()->all();
---
SELECT * FROM `categories`